
function UserAgreementPage () {
    return (
        <div id="root">
            <div className="MuiBox-root css-tjok8r">
                <div className="page-layout_root__pcqgd">

                    <div className="content-layout_root__QmNTy">
                        <div className="agreement_container__hrTPd">
                            <div className="agreement-view_agreement__cZOm5"><h1
                                className="MuiTypography-root MuiTypography-h1 css-1g46yb2">Пользовательское
                                соглашение</h1>
                                <div className="agreement-view_content__Rg5Nt">
                                    <section className="MuiBox-root css-0"><h2
                                        className="MuiTypography-root MuiTypography-h2 css-qifi04">1. Термины и
                                        определения</h2><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">1.1. <b>Вайлдберриз</b> –
                                        общество с ограниченной ответственностью «РВБ», адрес местонахождения: 142181,
                                        Московская область, г.о. Подольск, д. Коледино, тер. Индустриальный Парк
                                        Коледино, д.6, строение 1; ИНН 9714053621; ОГРН 1247700471919 и/или любое
                                        юридическое лицо в любой стране мира, находящееся под прямым или косвенным
                                        контролем ООО «РВБ».</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">1.2. <b>Соглашение</b> –
                                        настоящее пользовательское соглашение Вайлдберриз, включающее в себя условия
                                        Пользовательского соглашения сервисов Вайлдберриз, указанного в п. 3.4
                                        Соглашения.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">1.3. <b>Сервис</b> –
                                        комплекс программ для ЭВМ, посредством которых Пользователь получает возможность
                                        доступа к их функциональным возможностям в форме веб-сайта https://forms.wb.ru.
                                        Сервис предоставляет возможность создания, публикации и/или прохождения опросов,
                                        тестов, голосований и викторин в сети Интернет (далее – Формы).</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">1.4. <b>Пользователь</b> –
                                        любое физическое лицо, которое приняло Соглашение и использует Сервис.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">1.5. <b>Личный
                                        кабинет</b> – учётная запись Пользователя на Сервисе, доступ к которой
                                        осуществляется путем ввода аутентификационных данных Пользователя: Логина и
                                        Пароля.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">1.6. <b>Логин</b> –
                                        номер мобильного телефона, указанный и/или используемый Пользователем для
                                        идентификации Пользователя.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">1.7. <b>Пароль</b> –
                                        комбинация из не менее 6 (шести) символов латинскими буквами, генерируемая
                                        Вайлдберриз и передаваемая им Пользователю.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">1.8. <b>Регистрация</b> –
                                        процесс, включающий создание Личного кабинета посредством заполнения и отправки
                                        Пользователем формы путем указания необходимых сведений.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">1.9. <b>Авторизация</b> –
                                        процесс получения Пользователем доступа к Сервису путём введения корректного
                                        Логина и Пароля.</p></section>
                                    <section className="MuiBox-root css-0"><h2
                                        className="MuiTypography-root MuiTypography-h2 css-qifi04">2. Регистрация и
                                        Авторизация на Сервисе</h2><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">2.1. Для
                                        Регистрации и последующей Авторизации на Сервисе Пользователь должен иметь
                                        личный кабинет на Торговой площадке Wildberries. При Авторизации Вайлдберриз
                                        вправе использовать данные личного кабинета Пользователя на Торговой площадке
                                        Wildberries.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">2.2. Если у
                                        Пользователя нет личного кабинета на Торговой площадке Wildberries, он будет
                                        создан с указанным номером телефона в соответствии с Правилами пользования
                                        Торговой площадкой.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">2.3. Пользователь
                                        обязан обеспечить конфиденциальность аутентификационных данных. В случае, если
                                        Пользователь предоставит третьим лицам доступ к Личному кабинету, Пользователь в
                                        полном объеме отвечает за любые действия и бездействие таких лиц, совершенные
                                        ими при использовании Сервиса, как за свои собственные.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">2.4. В любом
                                        случае определение того или иного лица как Пользователя Сервиса осуществляется с
                                        использованием тех же данных, которые были указаны при Регистрации.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">2.5. При
                                        Регистрации Пользователям предоставляется возможность:</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">Создавать Формы,
                                        переименовывать, группировать, копировать, настраивать, публиковать, удалять
                                        их;</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">Собирать и
                                        экспортировать ответы в любой момент;</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">Отвечать на
                                        опубликованные Формы с неанонимными ответами.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">2.6.
                                        Пользователи, не прошедшие Регистрацию, имеют возможность заполнять Формы, а
                                        именно принимать участие в опросах, тестах, голосованиях, викторинах, для
                                        которых настроены анонимные ответы.</p></section>
                                    <section className="MuiBox-root css-0"><h2
                                        className="MuiTypography-root MuiTypography-h2 css-qifi04">3. Общие
                                        положения</h2><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">3.1. Вайлдберриз
                                        предоставляет Пользователям возможность использовать функционал Сервиса в
                                        соответствии с условиями Соглашения.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">3.2.
                                        Пользователь, используя доступный функционал Сервиса, автоматически подтверждает
                                        принятие всех условий Соглашения в полном объеме в редакции, действующей на
                                        момент совершения указанных действий.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">3.3. Изменение
                                        Соглашения осуществляется посредством внесения изменений в текст Соглашения и
                                        допускается без дополнительного уведомления Пользователя. Новая редакция
                                        вступает в силу с момента ее опубликования, если иное не предусмотрено
                                        соответствующей редакцией.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">3.4. Действие
                                        Соглашения распространяется на все последующие обновления/новые версии Сервиса.
                                        Осуществляя установку обновления/новой версии, Пользователь принимает условия
                                        Соглашения для соответствующих обновлений/новых версий Сервиса.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">3.5. Неотъемлемой
                                        частью Соглашения является «Пользовательское соглашение сервисов Вайлдберриз». В
                                        случае возникновения расхождений условий, условия Пользовательского соглашения
                                        сервисов Вайлдберриз имеют преимущественное значение.</p></section>
                                    <section className="MuiBox-root css-0"><h2
                                        className="MuiTypography-root MuiTypography-h2 css-qifi04">4. Условия
                                        использования Сервиса</h2><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">4.1. При
                                        использовании Сервиса Пользователь обязуется использовать функциональные
                                        возможности добросовестно и в соответствии с их прямым назначением, определенным
                                        Соглашением, пользовательскими документами и интерфейсами Сервиса.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">4.2. При
                                        использовании Сервиса Пользователю запрещено:</p>
                                        <div className="MuiTypography-root MuiTypography-body1 css-1nlxso0">
                                            <ul>
                                                <li>4.2.1. предпринимать действия по обходу ограничений для доступа к
                                                    Сервису и функциональным возможностям Сервиса, в том числе, но не
                                                    ограничиваясь, обходу ограничений, предусмотренных п. 6.4.
                                                    Соглашения;
                                                </li>
                                                <li>4.2.2. предпринимать действия, которые могут негативно влиять на
                                                    работу Сервиса;
                                                </li>
                                                <li>4.2.3. изменять, копировать, стирать, сохранять, выкачивать
                                                    (выгружать), распространять, передавать, воспроизводить (за
                                                    исключением использования по функциональному назначению), продавать
                                                    и иным образом использовать информацию, размещенную в Сервисе, а
                                                    также код или часть кода Сервиса, кроме случаев, предусмотренных
                                                    функционалом Сервиса, без предварительного разрешения Вайлдберриз.
                                                </li>
                                                <li>4.2.4. использовать Сервис в целях нарушения прав третьих лиц,
                                                    использовать выявленные уязвимости в работе Сервиса для нарушения
                                                    прав Вайлдберриз и третьих лиц, а также иных целей, противоречащих
                                                    Соглашению, пользовательским документам Сервиса, действующему
                                                    законодательству, а также нормальному использованию Сервиса.
                                                </li>
                                                <li>4.2.5. использовать ненормативную лексику (нецензурную речь),
                                                    оскорблять честь и достоинство других Пользователей, осуществлять
                                                    либо распространять информацию, содержащую призывы к массовым
                                                    беспорядкам, осуществлению экстремистской деятельности, участию в
                                                    массовых (публичных) мероприятиях, проводимых с нарушением
                                                    установленного законодательством порядка.
                                                </li>
                                            </ul>
                                        </div>
                                        <p className="MuiTypography-root MuiTypography-body1 css-1nlxso0">4.3.
                                            Использование функционала Сервиса предоставляется на условиях «как есть» (as
                                            is). Вайлдберриз не предоставляет никаких гарантий в отношении безошибочной
                                            и бесперебойной работы и отдельных функциональных возможностей Сервиса, а
                                            также не принимает на себя ответственности за соответствие Сервиса целям
                                            Пользователя. Для доступа к функционалу Сервиса от Пользователя может
                                            потребоваться соблюдение специальных технических требований Вайлдберриз,
                                            размещённых в Сервисе. Вайлдберриз не несёт ответственности за качество
                                            соединения с сетью Интернет и функционирование оборудования и программного
                                            обеспечения Пользователя.</p><p
                                            className="MuiTypography-root MuiTypography-body1 css-1nlxso0">4.4.
                                            Вайлдберриз не несёт ответственности за какие-либо прямые или косвенные
                                            последствия какого-либо использования или невозможности использования
                                            Сервиса и / или любой ущерб и упущенную выгоду, причиненные Пользователю и /
                                            или третьим сторонам в результате какого-либо использования, неиспользования
                                            или невозможности использования Сервиса или отдельных его компонентов и /
                                            или функций, в том числе из-за возможных ошибок или сбоев в работе Сервиса,
                                            за исключением случаев, предусмотренных законодательством.</p><p
                                            className="MuiTypography-root MuiTypography-body1 css-1nlxso0">4.5.
                                            Вайлдберриз не несёт ответственности за какие-либо прямые или косвенные
                                            последствия, а также за любой ущерб и упущенную выгоду, причиненные
                                            Пользователю и / или третьим сторонам в результате несанкционированного
                                            доступа любых третьих лиц к данным Пользователя в связи с нарушением
                                            Пользователем обязательств по соблюдению конфиденциальности указанных
                                            данных.</p><p
                                            className="MuiTypography-root MuiTypography-body1 css-1nlxso0">4.6.
                                            Вайлдберриз не несёт никакой ответственности за содержание Форм, а также не
                                            возмещает никакой ущерб, прямой или косвенный, причиненный Пользователю в
                                            результате использования Сервиса. Пользователь настоящим уведомлен и
                                            соглашается с тем, что Формы могут создаваться третьими лицами без участия
                                            Вайлдберриз. Пользователь уведомлен, что Вайлдберриз не обязан
                                            просматривать/модерировать контент любого вида, размещаемый и/или
                                            распространяемый третьими лицами.</p><p
                                            className="MuiTypography-root MuiTypography-body1 css-1nlxso0">4.7. В
                                            зависимости от региона Пользователя функционал Сервиса может быть недоступен
                                            или ограничен. Функционал считается недоступным (ограниченным) для
                                            Пользователя из определенного региона, если такой Пользователь не может ими
                                            воспользоваться в явном виде. Применение любых технических и программных
                                            методов обхода данных ограничений запрещено. Положения Соглашения,
                                            регулирующие недоступный (ограниченный) для Пользователя функционал Сервиса,
                                            не применяются до тех пор, пока Пользователю функционал Сервиса не станет
                                            доступен в явном виде.</p></section>
                                    <section className="MuiBox-root css-0"><h2
                                        className="MuiTypography-root MuiTypography-h2 css-qifi04">5. Персональные
                                        данные</h2><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">5.1. Пользователь
                                        осознает и соглашается с тем, что в случае, если Пользователь прошел Регистрацию
                                        и Авторизацию, для предоставления Сервиса, его отдельных функциональных
                                        возможностей, включая создание Форм, Вайлдберриз обрабатывает данные
                                        Пользователя, предоставленные им на Торговой площадке Wildberries, в Сервисе или
                                        созданные в процессе использования Сервиса, его отдельных функциональных
                                        возможностей в составе: номер телефона (Логин), идентификационный номер
                                        пользователя на Торговой площадке Wildberries, а также, если данные были
                                        предоставлены на Торговой площадке Wildberries, имя (псевдоним) / ФИО, дата
                                        рождения, адрес электронной почты, техническая информация об использовании
                                        Сервиса. В случае, если Пользователь не прошел Регистрацию и Авторизацию в
                                        Сервисе указанные в настоящем пункте данные не обрабатываются Вайлдберриз.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">5.2. Вайлдберриз
                                        вправе направлять Пользователю, прошедшему Регистрацию и Авторизацию, сообщения
                                        информационного характера, в том числе относящиеся к ограничениям доступа к
                                        Сервису в связи с техническими работами, а также информацию о новых доступных
                                        функциях Сервиса, поскольку такая информация относится к использованию
                                        функциональных возможностей Сервиса или исполнения договоров с Пользователем на
                                        Сервисе.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">5.3. Сервис не
                                        предназначен для обработки, в том числе сбора персональных данных. Пользователь,
                                        создавший Форму, самостоятельно решает, что он будет осуществлять с помощью
                                        Сервиса обработку персональных данных, а также определяет цели обработки
                                        персональных данных, состав персональных данных, подлежащих обработке, действия
                                        (операции), совершаемые с персональными данными, т.е. такой Пользователь
                                        является самостоятельным оператором персональных данных в отношении лиц,
                                        заполняющих Форм. При обработке персональных данных посредством Сервиса
                                        Пользователь самостоятельно обеспечивает правомерность обработки персональных
                                        данных, а также гарантирует Вайлдберриз наличие правовых оснований для передачи
                                        данных Вайлдберриз и их дальнейшей обработки Вайлдберриз, необходимой для
                                        исполнения Соглашения.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">5.4. Пользователь
                                        обязан соблюдать требования применимого законодательства в области персональных
                                        данных при создании Форм. Вайлдберриз строго запрещает Пользователю создавать
                                        Формы, предполагающие предоставление специальных категорий персональных данных,
                                        касающихся расовой, национальной принадлежности, политических взглядов,
                                        религиозных или философских убеждений, состояния здоровья, интимной жизни,
                                        персональных данных о судимости. Пользователь обязан возместить Вайлдберриз
                                        убытки, причиненные Вайлдберриз вследствие нарушения Пользователем применимого
                                        законодательства в области персональных данных. Вайлдберриз не отвечает перед
                                        Пользователем и иным лицом, заполняющим Формы, за нарушения применимого
                                        законодательства в области персональных данных, допущенные Пользователем,
                                        создавшим Формы.</p></section>
                                    <section className="MuiBox-root css-0"><h2
                                        className="MuiTypography-root MuiTypography-h2 css-qifi04">6.
                                        Ответственность</h2><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">6.1. При
                                        использовании Сервиса Пользователь обязуется соблюдать применимое
                                        законодательство. Пользователь самостоятельно несёт ответственность за
                                        содержание любой информации/Формы, публикуемой или загружаемой Пользователем в
                                        Сервис, и обязуется самостоятельно возместить любой ущерб, причиненный третьим
                                        лицам в связи с действиями Пользователя, которые нарушают применимое
                                        законодательство и условия Соглашения.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">6.2. Пользователь
                                        гарантирует, что обладает всеми необходимыми правами и / или им получены все
                                        требующиеся разрешения от правообладателей в отношении публикуемой или
                                        передаваемой Пользователем информации. В случае поступления претензий от третьих
                                        лиц, связанных с нарушением их исключительных прав, Пользователь самостоятельно
                                        и за свой счет урегулирует указанные претензии.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">6.3. В случае
                                        использования Сервиса каким-либо способом, не предусмотренным или прямо
                                        запрещенным настоящим Соглашением, а также по одностороннему решению,
                                        Вайлдберриз вправе ограничить или полностью запретить Пользователю использование
                                        функционала Сервиса, в том числе без объяснения причин. Вайлдберриз оставляет за
                                        собой право на свое усмотрение ограничить доступ Пользователя к Сервису (или к
                                        определенным функциям Сервиса) или полностью заблокировать аккаунт Пользователя
                                        при неоднократном нарушении Соглашения, удалить Форму, применить к Пользователю
                                        иные меры с целью соблюдения требований законодательства, Соглашения или прав и
                                        законных интересов третьих лиц.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">6.4. В случае
                                        использования Сервиса каким-либо способом, не предусмотренным или прямо
                                        запрещенным Соглашением, Пользователь обязуется в полном объеме возместить за
                                        свой счет Вайлдберриз и лицам, которым был причинен вред, убытки, возникшие у
                                        них в связи с действиями Пользователя.</p></section>
                                    <section className="MuiBox-root css-0"><h2
                                        className="MuiTypography-root MuiTypography-h2 css-qifi04">7. Разрешение
                                        споров</h2><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">7.1. Все споры,
                                        разногласия и претензии, которые могут возникнуть в связи с заключением,
                                        исполнением, изменением, расторжением или признанием недействительным
                                        Соглашения, Стороны будут стремиться решить путём переговоров. Сторона, у
                                        которой возникли претензии и/или разногласия, направляет другой Стороне
                                        сообщение с указанием возникших претензий и/или разногласий.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">7.2. Сообщение
                                        Пользователя о возникших претензиях и/или разногласиях должно быть направлено
                                        Пользователем по электронному адресу forms@rwb.ru, а также продублировано в
                                        письменном виде по адресу Вайлдберриз, указанному в Соглашении.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">7.3. В случае
                                        если ответ на сообщение не будет получен направившей сообщение Стороной в
                                        течение 30 (тридцати) рабочих дней с даты направления соответствующего сообщения
                                        либо если Стороны не придут к соглашению по возникшим претензиям и/или
                                        разногласиям, спор подлежит разрешению в Арбитражном суде г. Москвы или в
                                        Тимирязевском районном суде г. Москвы.</p></section>
                                    <section className="MuiBox-root css-0"><h2
                                        className="MuiTypography-root MuiTypography-h2 css-qifi04">8. Заключительные
                                        положения</h2><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">8.1. Соглашение
                                        регулируется и толкуется в соответствии с действующим законодательством
                                        Российской Федерации. Вопросы, не урегулированные Соглашением, подлежат
                                        разрешению в соответствии с законодательством Российской Федерации.</p><p
                                        className="MuiTypography-root MuiTypography-body1 css-1nlxso0">8.2. Если по тем
                                        или иным причинам одно или несколько положений Соглашения будут признаны
                                        недействительными или не имеющими юридической силы, это не оказывает влияния на
                                        действительность остальных положений Соглашения.</p></section>
                                </div>
                            </div>
                        </div>
                        <div className="footer-layout_root__BXIlW css-1yyw0cc">
                            <div className="footer-layout_left__deNKc MuiBox-root css-urs9at">Компания ООО «РВБ» не
                                несёт ответственности за содержание форм, созданных третьими лицами. © ООО «РВБ», 2025
                            </div>
                            <div className="footer-layout_right__DIuqy">
                                <div className="css-14u26wt"><a
                                    className="MuiTypography-root MuiTypography-text typography-link_root__ZTRSX css-5z83ex"
                                    href="/agreement">Пользовательское соглашение</a><a
                                    className="MuiTypography-root MuiTypography-inherit MuiLink-root MuiLink-underlineAlways css-1hkr19v"
                                    href="/docs" target="_blank">Документация</a><p
                                    className="MuiTypography-root MuiTypography-body1 css-jb6pz8">Сообщить о
                                    проблеме</p></div>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    );
}

export default UserAgreementPage;